--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·火扩展包文件）
]]--
--[[****************************************************************
	火·典韦
]]--****************************************************************
sgs.AIGenerals["dianwei"] = {
	name = "dianwei",
	general = "dianwei",
	IQ = 100,
}
--[[
	技能：强袭
	描述：出牌阶段限一次，你可以失去1点体力或弃置一张武器牌，并选择你攻击范围内的一名角色，对其造成1点伤害。
]]--
sgs.AISkills["qiangxi"] = {
	name = "qiangxi",
}
--[[****************************************************************
	火·荀彧
]]--****************************************************************
sgs.AIGenerals["xunyu"] = {
	name = "xunyu",
	general = "xunyu",
	IQ = 150,
}
--[[
	技能：驱虎
	描述：出牌阶段限一次，你可以与一名当前的体力值大于你的角色拼点：若你赢，其对其攻击范围内你选择的另一名角色造成1点伤害。若你没赢，其对你造成1点伤害。
]]--
sgs.AISkills["quhu"] = {
	name = "quhu",
}
--[[
	技能：节命
	描述：每当你受到1点伤害后，你可以令一名角色将手牌补至X张。（X为该角色体力上限且至多为5）
]]--
sgs.AISkills["jieming"] = {
	name = "jieming",
	frequency = sgs.Skill_NotFrequent,
	events = {sgs.Damaged},
	priority = 1,
}
--[[****************************************************************
	火·庞统
]]--****************************************************************
sgs.AIGenerals["pangtong"] = {
	name = "pangtong",
	general = "pangtong",
	IQ = 180,
}
--[[
	技能：连环
	描述：你可以将一张♣手牌当【铁索连环】使用或重铸。
]]--
sgs.AISkills["lianhuan"] = {
	name = "lianhuan",
}
--[[
	技能：涅槃（限定技）
	描述：当你处于濒死状态时，你可以弃置你区域里所有的牌，然后将你的武将牌翻转至正面朝上并重置之，再摸三张牌且将你当前的体力值回复至3点。
]]--
sgs.AISkills["niepan"] = {
	name = "niepan",
	frequency = sgs.Skill_Limited,
	events = {sgs.Dying},
	priority = 1,
}
--[[****************************************************************
	火·诸葛亮
]]--****************************************************************
sgs.AIGenerals["wolong"] = {
	name = "wolong",
	general = "zhugeliang",
	IQ = 230,
}
--[[
	技能：火计
	描述：你可以将一张红色手牌当【火攻】使用。
]]--
sgs.AISkills["huoji"] = {
	name = "huoji",
}
--[[
	技能：看破
	描述：你可以将一张黑色手牌当【无懈可击】使用。
]]--
sgs.AISkills["kanpo"] = {
	name = "kanpo",
}
--[[
	技能：八阵（锁定技）
	描述：若你的装备区没有防具牌，视为你装备【八卦阵】。
]]--
sgs.AISkills["bazhen"] = {
	name = "bazhen",
}
--[[****************************************************************
	火·太史慈
]]--****************************************************************
sgs.AIGenerals["taishici"] = {
	name = "taishici",
	general = "taishici",
	IQ = 100,
}
--[[
	技能：天义
	描述：出牌阶段限一次，你可以与一名角色拼点。若你赢，你获得以下锁定技，直到回合结束：你使用【杀】无距离限制；你于出牌阶段内能额外使用一张【杀】；你使用【杀】选择目标的个数上限+1。若你没赢，你不能使用【杀】，直到回合结束。
]]--
sgs.AISkills["tianyi"] = {
	name = "tianyi",
}
--[[****************************************************************
	火·袁绍
]]--****************************************************************
sgs.AIGenerals["yuanshao"] = {
	name = "yuanshao",
	general = "yuanshao",
	lord = true,
	IQ = 100,
}
--[[
	技能：乱击
	描述：你可以将两张相同花色的手牌当【万箭齐发】使用。
]]--
sgs.AISkills["luanji"] = {
	name = "luanji",
}
--[[
	技能：血裔（主公技、锁定技）
	描述：你的手牌上限+2X。（X为其他群雄角色的数量）
]]--
sgs.AISkills["xueyi"] = {
	name = "xueyi",
	lord = true,
}
--[[****************************************************************
	火·颜良&文丑
]]--****************************************************************
sgs.AIGenerals["yanliangwenchou"] = {
	name = "yanliangwenchou",
	general = "yanliang+wenchou",
	IQ = 100,
}
--[[
	技能：双雄
	描述：摸牌阶段开始时，你可以放弃摸牌，改为进行一次判定，当判定牌生效后，你获得此牌，然后你于此回合内可以将一张与此牌颜色不同的手牌当【决斗】使用。
]]--
sgs.AISkills["shuangxiong"] = {
	name = "shuangxiong",
}
--[[****************************************************************
	火·庞德
]]--****************************************************************
sgs.AIGenerals["pangde"] = {
	name = "pangde",
	general = "pangde",
	IQ = 100,
}
--[[
	技能：马术（锁定技）
	描述：你与其他角色的距离-1。
]]--
--[[
	技能：猛进
	描述：你使用的【杀】被目标角色的【闪】抵消后，你可以弃置该角色的一张牌。
]]--
sgs.AISkills["mengjin"] = {
	name = "mengjin",
	frequency = sgs.Skill_NotFrequent,
	events = {sgs.SlashMissed},
	priority = 1,
}