--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·翼扩展包文件）
]]--
--[[****************************************************************
	夏侯惇
]]--****************************************************************
sgs.AIGenerals["neo_xiahoudun"] = {
	name = "neo_xiahoudun",
	general = "xiahoudun",
	IQ = 100,
}
--[[
	技能：刚烈
	描述：每当你受到伤害后，你可以进行一次判定，若判定结果不为♥，则你选择一项：令伤害来源弃置两张手牌，或对伤害来源造成1点伤害。
]]--
sgs.AISkills["neoganglie"] = {
	name = "neoganglie",
}
--[[****************************************************************
	许褚
]]--****************************************************************
sgs.AIGenerals["neo_xuchu"] = {
	name = "neo_xuchu",
	general = "xuchu",
	IQ = 100,
}
--[[
	技能：裸衣
	描述：出牌阶段限一次，你可以弃置一张装备牌，若如此做，本回合你使用【杀】或【决斗】对目标角色造成伤害时，此伤害+1。
]]--
sgs.AISkills["neoluoyi"] = {
	name = "neoluoyi",
}
--[[****************************************************************
	曹仁
]]--****************************************************************
sgs.AIGenerals["neo_caoren"] = {
	name = "neo_caoren",
	general = "caoren",
	IQ = 100,
}
--[[
	技能：据守
	描述：结束阶段开始时，你可以摸X+2张牌，然后将你的武将牌翻面。（X为你已损失的体力值）
]]--
sgs.AISkills["neojushou"] = {
	name = "neojushou",
}
--[[****************************************************************
	关羽
]]--****************************************************************
sgs.AIGenerals["neo_guanyu"] = {
	name = "neo_guanyu",
	general = "guanyu",
	IQ = 100,
}
--[[
	技能：武圣
	描述：你可以将一张红色牌当【杀】使用或打出。
]]--
--[[
	技能：义释
	描述：每当你使用♥【杀】对目标角色造成伤害时，你可以防止此伤害，然后获得其区域里的一张牌。
]]--
sgs.AISkills["yishi"] = {
	name = "yishi",
}
--[[****************************************************************
	张飞
]]--****************************************************************
sgs.AIGenerals["neo_zhangfei"] = {
	name = "neo_zhangfei",
	general = "zhangfei",
	IQ = 100,
}
--[[
	技能：咆哮（锁定技）
	描述：你于出牌阶段内使用【杀】无数量限制。
]]--
--[[
	技能：探囊（锁定技）
	描述：你与其他角色的距离-X。（X为你已损失的体力值）
]]--
sgs.AISkills["tannang"] = {
	name = "tannang",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	赵云
]]--****************************************************************
sgs.AIGenerals["neo_zhaoyun"] = {
	name = "neo_zhaoyun",
	general = "zhaoyun",
	IQ = 100,
}
--[[
	技能：龙胆
	描述：你可以将一张【杀】当【闪】使用或打出，或将一张【闪】当【杀】使用或打出。
]]--
--[[
	技能：义从（锁定技）
	描述：若你的体力值大于2，你与其他角色的距离-1；若你的体力值小于或等于2，其他角色与你的距离+1。
]]--
--[[****************************************************************
	周瑜
]]--****************************************************************
sgs.AIGenerals["neo_zhouyu"] = {
	name = "neo_zhouyu",
	general = "zhouyu",
	IQ = 100,
}
--[[
	技能：英姿
	描述：摸牌阶段，你可以额外摸一张牌。 
]]--
--[[
	技能：反间
	描述：出牌阶段限一次，你可以选择一张手牌并令一名其他角色选择一种花色，然后该角色获得该牌并展示之。若此牌花色与该角色所选花色不同，你对其造成1点伤害。
]]--
sgs.AISkills["neofanjian"] = {
	name = "neofanjian",
}
--[[****************************************************************
	公孙瓒
]]--****************************************************************
sgs.AIGenerals["neo_gongsunzan"] = {
	name = "neo_gongsunzan",
	general = "gongsunzan",
	IQ = 100,
}
--[[
	技能：筑楼
	描述：结束阶段开始时，你可以摸两张牌，然后选择一项：失去1点体力，或弃置一张武器牌。
]]--
sgs.AISkills["zhulou"] = {
	name = "zhulou",
}
--[[
	技能：义从（锁定技）
	描述：若你的体力值大于2，你与其他角色的距离-1；若你的体力值小于或等于2，其他角色与你的距离+1。
]]--