--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·怀旧扩展包文件）
]]--
--[[****************************************************************
	刘备
]]--****************************************************************
sgs.AIGenerals["nos_liubei"] = {
	name = "nos_liubei",
	general = "liubei",
	lord = true,
	IQ = 100,
}
--[[
	技能：仁德
	描述：出牌阶段，你可以将任意数量的手牌交给一名其他角色，然后当你于此阶段内以此法交给其他角色的手牌首次达到两张或更多时，你回复1点体力
]]--
sgs.AISkills["nosrende"] = {
	name = "nosrende",
}
--[[
	技能：激将（主公技）
	描述：当你需要使用或打出一张【杀】时，你可令其他蜀势力角色打出一张【杀】（视为由你使用或打出）。
]]--
--[[****************************************************************
	黄月英
]]--****************************************************************
sgs.AIGenerals["nos_huangyueying"] = {
	name = "nos_huangyueying",
	general = "huangyueying",
	IQ = 100,
}
--[[
	技能：集智
	描述：每当你使用非延时类锦囊牌选择目标后，你可以摸一张牌。
]]--
sgs.AISkills["nosjizhi"] = {
	name = "nosjizhi",
}
--[[
	技能：奇才（锁定技）
	描述：你使用锦囊牌无距离限制。
]]--
sgs.AISkills["nosqicai"] = {
	name = "nosqicai",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	貂蝉
]]--****************************************************************
sgs.AIGenerals["nos_diaochan"] = {
	name = "nos_diaochan",
	general = "diaochan",
	IQ = 100,
}
--[[
	技能：离间
	描述：出牌阶段限一次，你可以弃置一张牌并选择两名男性角色，令其中一名男性角色视为对另一名男性角色使用一张【决斗】（不能使用【无懈可击】对此【决斗】进行响应）。
]]--
sgs.AISkills["noslijian"] = {
	name = "noslijian",
}
--[[
	技能：闭月
	描述：结束阶段开始时，你可以摸一张牌。
]]--
--[[****************************************************************
	曹仁
]]--****************************************************************
sgs.AIGenerals["nos_caoren"] = {
	name = "nos_caoren",
	general = "caoren",
	IQ = 100,
}
--[[
	技能：据守
	描述：结束阶段开始时，你可以摸三张牌，然后将武将牌翻面。
]]--
sgs.AISkills["nosjushou"] = {
	name = "nosjushou",
}
--[[****************************************************************
	周泰
]]--****************************************************************
sgs.AIGenerals["nos_zhoutai"] = {
	name = "nos_zhoutai",
	general = "zhoutai",
	IQ = 100,
}
--[[
	技能：不屈
	描述：每当你扣减1点体力后，若你的体力值为0或更低，你可以将牌堆顶的一张牌置于你的武将牌上，然后若无同点数的“不屈牌”，你不进入濒死状态。每当你回复1点体力后，你将一张“不屈牌”置入弃牌堆。
]]--
sgs.AISkills["nosbuqu"] = {
	name = "nosbuqu",
}
--[[****************************************************************
	张角
]]--****************************************************************
sgs.AIGenerals["nos_zhangjiao"] = {
	name = "nos_zhangjiao",
	general = "zhangjiao",
	lord = true,
	IQ = 100,
}
--[[
	技能：雷击
	描述：每当你使用或打出一张【闪】时，你可以令一名角色进行判定：若结果为♠，你对该角色造成2点雷电伤害。
]]--
sgs.AISkills["nosleiji"] = {
	name = "nosleiji",
}
--[[
	技能：鬼道
	描述：每当一名角色的判定牌生效前，你可以打出一张黑色牌替换之。
]]--
--[[
	技能：黄天（主公技）
	描述：出牌阶段限一次，其他群雄角色的出牌阶段，该角色可以交给你一张【闪】或【闪电】。
]]--
--[[****************************************************************
	于吉
]]--****************************************************************
sgs.AIGenerals["nos_yuji"] = {
	name = "nos_yuji",
	general = "yuji",
	IQ = 100,
}
--[[
	技能：蛊惑
	描述：你可以扣置一张手牌当做一张基本牌或非延时锦囊牌使用或打出，体力值大于0的其他角色选择是否质疑，然后你展示该牌：若无角色质疑，该牌按你所述类型结算；若有角色质疑：若该牌为真，质疑角色各失去1点体力；若该牌为假，质疑角色各摸一张牌；且若该牌为♥且为真，则依旧进行结算，否则将其置入弃牌堆。
]]--
sgs.AISkills["nosguhuo"] = {
	name = "nosguhuo",
}
--[[****************************************************************
	法正
]]--****************************************************************
sgs.AIGenerals["nos_fazheng"] = {
	name = "nos_fazheng",
	general = "fazheng",
	IQ = 100,
}
--[[
	技能：恩怨（锁定技）
	描述：每当你回复1点体力后，令你回复体力的角色摸一张牌；每当你受到伤害后，伤害来源选择一项：交给你一张♥手牌，或失去1点体力。
]]--
sgs.AISkills["nosenyuan"] = {
	name = "nosenyuan",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：眩惑
	描述：出牌阶段限一次，你可以将一张♥手牌交给一名其他角色，然后你获得该角色的一张牌，将该牌交给除该角色外的另一名角色。
]]--
sgs.AISkills["nosxuanhuo"] = {
	name = "nosxuanhuo",
}
--[[****************************************************************
	凌统
]]--****************************************************************
sgs.AIGenerals["nos_lingtong"] = {
	name = "nos_lingtong",
	general = "lingtong",
	IQ = 100,
}
--[[
	技能：旋风
	描述：每当你失去一次装备区里的牌后，你可以选择一项：视为对一名其他角色使用一张无距离限制的【杀】，或对距离1的一名角色造成1点伤害
]]--
sgs.AISkills["nosxuanfeng"] = {
	name = "nosxuanfeng",
}
--[[****************************************************************
	徐庶
]]--****************************************************************
sgs.AIGenerals["nos_xushu"] = {
	name = "nos_xushu",
	general = "xushu",
	IQ = 100,
}
--[[
	技能：无言（锁定技）
	描述：你使用的非延时类锦囊牌对其他角色无效。其他角色使用的非延时类锦囊牌对你无效 
]]--
sgs.AISkills["noswuyan"] = {
	name = "noswuyan",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：举荐
	描述：出牌阶段限一次，你可以弃置至多三张牌并选择一名其他角色，该角色摸等量的牌。若你以此法弃置三张同一类别的牌，你回复1点体力。
]]--
sgs.AISkills["nosjujian"] = {
	name = "nosjujian",
}
--[[****************************************************************
	张春华
]]--****************************************************************
sgs.AIGenerals["nos_zhangchunhua"] = {
	name = "nos_zhangchunhua",
	general = "zhangchunhua",
	IQ = 100,
}
--[[
	技能：绝情（锁定技）
	描述：你即将造成的伤害视为失去体力。
]]--
--[[
	技能：伤逝
	描述：弃牌阶段外，每当你的手牌数小于你已损失的体力值时，你可以将手牌数补至等同于你已损失的体力值。
]]--
sgs.AISkills["nosshangshi"] = {
	name = "nosshangshi",
}
--[[****************************************************************
	关兴张苞
]]--****************************************************************
sgs.AIGenerals["nos_guanxingzhangbao"] = {
	name = "nos_guanxingzhangbao",
	general = "guanxing+zhangbao",
	IQ = 100,
}
--[[
	技能：父魂
	描述：摸牌阶段开始时，你可以放弃摸牌，展示牌堆顶的两张牌并获得之。若展示的牌不为同一颜色，你获得技能“武圣”、“咆哮”，直到回合结束。
]]--
sgs.AISkills["nosfuhun"] = {
	name = "nosfuhun",
}
--[[****************************************************************
	韩当
]]--****************************************************************
sgs.AIGenerals["nos_handang"] = {
	name = "nos_handang",
	general = "handang",
	IQ = 100,
}
--[[
	技能：弓骑
	描述：你可以将一张装备牌当【杀】使用或打出。你以此法使用的【杀】无距离限制。
]]--
sgs.AISkills["nosgongqi"] = {
	name = "nosgongqi",
}
--[[
	技能：解烦
	描述：你的回合外，当一名角色处于濒死状态时，你可以对当前回合角色使用一张【杀】。此【杀】造成伤害时你防止此伤害，视为对该濒死角色使用了一张【桃】。
]]--
sgs.AISkills["nosjiefan"] = {
	name = "nosjiefan",
}
--[[****************************************************************
	马岱
]]--****************************************************************
sgs.AIGenerals["nos_madai"] = {
	name = "nos_madai",
	general = "madai",
	IQ = 100,
}
--[[
	技能：马术（锁定技）
	描述：你与其他角色的距离-1。
]]--
--[[
	技能：潜袭
	描述：每当你使用【杀】对距离1的目标角色造成伤害时，你可以进行一次判定，若判定结果不为♥，你防止此伤害，该角色减1点体力上限。
]]--
sgs.AISkills["nosqianxi"] = {
	name = "nosqianxi",
}
--[[****************************************************************
	王异
]]--****************************************************************
sgs.AIGenerals["nos_wangyi"] = {
	name = "nos_wangyi",
	general = "wangyi",
	IQ = 100,
}
--[[
	技能：贞烈
	描述：每当你的判定牌生效前，你可以展示牌堆顶的一张牌代替之。
]]--
sgs.AISkills["noszhenlie"] = {
	name = "noszhenlie",
}
--[[
	技能：秘计
	描述：回合开始或结束阶段开始时，若你已受伤，你可以进行一次判定，若判定结果为黑色，你观看牌堆顶的X张牌然后将其交给一名角色。（X为你已损失的体力值）
]]--
sgs.AISkills["nosmiji"] = {
	name = "nosmiji",
}
--[[****************************************************************
	曹冲
]]--****************************************************************
sgs.AIGenerals["caochong"] = {
	name = "caochong",
	general = "caochong",
	IQ = 100,
}
--[[
	技能：称象
	描述：每当你受到一次伤害后，你可以展示牌堆顶的四张牌，然后获得其中任意数量点数之和小于13的牌，并将其余的牌置入弃牌堆。
]]--
sgs.AISkills["chengxiang"] = {
	name = "chengxiang",
}
--[[
	技能：仁心
	描述：一名其他角色处于濒死状态时，你可以将武将牌翻面并将所有手牌交给该角色，令该角色回复1点体力。
]]--
sgs.AISkills["renxin"] = {
	name = "renxin",
}
--[[****************************************************************
	伏皇后
]]--****************************************************************
sgs.AIGenerals["fuhuanghou"] = {
	name = "fuhuanghou",
	general = "fushou",
	IQ = 100,
}
--[[
	技能：惴恐
	描述：一名其他角色的回合开始时，若你已受伤，你可以与其拼点：若你赢，该角色跳过出牌阶段；若你没赢，该角色与你距离为1，直到回合结束。
]]--
sgs.AISkills["zhuikong"] = {
	name = "zhuikong",
}
--[[
	技能：求援
	描述：每当你成为【杀】的目标时，你可以令一名除此【杀】使用者外的有手牌的其他角色正面朝上交给你一张手牌。若此牌不为【闪】，该角色也成为此【杀】的目标。
]]--
sgs.AISkills["qiuyuan"] = {
	name = "qiuyuan",
}
--[[****************************************************************
	李儒
]]--****************************************************************
sgs.AIGenerals["liru"] = {
	name = "liru",
	general = "liru",
	IQ = 100,
}
--[[
	技能：绝策
	描述：你的回合内，一名体力值大于0的角色失去最后的手牌后，你可以对其造成1点伤害。
]]--
sgs.AISkills["juece"] = {
	name = "juece",
}
--[[
	技能：灭计（锁定技）
	描述：你使用黑色非延时类锦囊牌的目标数上限至少为二。
]]--
sgs.AISkills["mieji"] = {
	name = "mieji",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：焚城（限定技）
	描述：出牌阶段，你可以令所有其他角色选择一项：弃置X张牌，或受到你对其造成的1点火焰伤害。（X为该角色装备区牌的数量且至少为1） 
]]--
sgs.AISkills["fencheng"] = {
	name = "fencheng",
	frequency = sgs.Skill_Limited,
}
--[[****************************************************************
	朱然
]]--****************************************************************
sgs.AIGenerals["zhuran"] = {
	name = "zhuran",
	general = "zhuran",
	IQ = 100,
}
--[[
	技能：胆守
	描述：每当你造成伤害后，你可以摸一张牌，然后结束当前回合并结束一切结算。
]]--
sgs.AISkills["danshou"] = {
	name = "danshou",
}