--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·OL专属扩展包文件）
]]--
--[[****************************************************************
	诸葛恪
]]--****************************************************************
sgs.AIGenerals["zhugeke"] = {
	name = "zhugeke",
	general = "zhugeke",
	IQ = 100,
}
--[[
	技能：傲才
	描述：你的回合外，每当你需要使用或打出一张基本牌时，你可以观看牌堆顶的两张牌，然后使用或打出其中一张该类别的基本牌。
]]--
sgs.AISkills["aocai"] = {
	name = "aocai",
}
--[[
	技能：黩武
	描述：出牌阶段，你可以弃置任意数量的牌并选择攻击范围内的一名体力值等于该数量的其他角色：若如此做，你对该角色造成1点伤害。若此伤害令该角色进入濒死状态，濒死结算后你失去1点体力，且本阶段“黩武”无效。
]]--
sgs.AISkills["duwu"] = {
	name = "duwu",
}