--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·标准包文件）
]]--
--[[****************************************************************
	曹操
]]--****************************************************************
sgs.AIGenerals["caocao"] = {
	name = "caocao",
	lord = true,
	IQ = 100,
}
--[[
	技能：奸雄
	描述：每当你受到一次伤害后，你可以获得对你造成伤害的牌。
]]--
sgs.AISkills["jianxiong"] = {
	name = "jianxiong",
}
--[[
	技能：护驾（主公技）
	描述：每当你需要使用或打出一张【闪】时，你可以令其他魏势力角色选择是否打出一张【闪】（视为由你使用或打出）。
]]--
sgs.AISkills["hujia"] = {
	name = "hujia",
	lord = true,
}
--[[****************************************************************
	司马懿
]]--****************************************************************
sgs.AIGenerals["simayi"] = {
	name = "simayi",
	IQ = 180,
}
--[[
	技能：反馈
	描述：每当你受到一次伤害后，你可以获得伤害来源的一张牌。
]]--
sgs.AISkills["fankui"] = {
	name = "fankui",
}
--[[
	技能：鬼才
	描述：每当一名角色的判定牌生效前，你可以打出一张手牌代替之。
]]--
sgs.AISkills["guicai"] = {
	name = "guicai",
}
--[[****************************************************************
	夏侯惇
]]--****************************************************************
sgs.AIGenerals["xiahoudun"] = {
	name = "xiahoudun",
	IQ = 100,
}
--[[
	技能：刚烈
	描述：每当你受到一次伤害后，你可以进行一次判定，若判定结果不为♥，则伤害来源选择一项：弃置两张手牌，或受到你造成的1点伤害。
]]--
sgs.AISkills["ganglie"] = {
	name = "ganglie",
}
--[[****************************************************************
	张辽
]]--****************************************************************
sgs.AIGenerals["zhangliao"] = {
	name = "zhangliao",
	IQ = 100,
}
--[[
	技能：突袭
	描述：摸牌阶段开始时，你可以放弃摸牌并选择一至两名有手牌的其他角色，改为获得他们的各一张手牌。
]]--
sgs.AISkills["tuxi"] = {
	name = "tuxi",
}
--[[****************************************************************
	许褚
]]--****************************************************************
sgs.AIGenerals["xuchu"] = {
	name = "xuchu",
	IQ = 100,
}
--[[
	技能：裸衣
	描述：摸牌阶段，你可以少摸一张牌，若如此做，每当你于此回合内使用【杀】或【决斗】对目标角色造成伤害时，此伤害+1。
]]--
sgs.AISkills["luoyi"] = {
	name = "luoyi",
}
--[[****************************************************************
	郭嘉
]]--****************************************************************
sgs.AIGenerals["guojia"] = {
	name = "guojia",
	IQ = 100,
}
--[[
	技能：天妒
	描述：每当你的判定牌生效后，你可以获得之。
]]--
sgs.AISkills["tiandu"] = {
	name = "tiandu",
}
--[[
	技能：遗计
	描述：每当你受到1点伤害后，你可以观看牌堆顶的两张牌，然后将一张牌交给一名角色，将另一张牌交给一名角色。
]]--
sgs.AISkills["yiji"] = {
	name = "yiji",
}
--[[****************************************************************
	甄姬
]]--****************************************************************
sgs.AIGenerals["zhenji"] = {
	name = "zhenji",
	IQ = 100,
}
--[[
	技能：倾国
	描述：你可以将一张黑色手牌当【闪】使用或打出。
]]--
sgs.AISkills["qingguo"] = {
	name = "qingguo",
}
--[[
	技能：洛神
	描述：准备阶段开始时，你可以进行一次判定，若判定结果为黑色，你获得生效后的判定牌且你可以重复此流程。
]]--
sgs.AISkills["luoshen"] = {
	name = "luoshen",
}
--[[****************************************************************
	刘备
]]--****************************************************************
sgs.AIGenerals["liubei"] = {
	name = "liubei",
	lord = true,
	IQ = 100,
}
--[[
	技能：仁德
	描述：出牌阶段限一次，你可以将任意数量的手牌以任意分配方式交给任意数量的其他角色，然后当你于以此法交给其他角色的手牌首次达到两张或更多时，你回复1点体力。
]]--
sgs.AISkills["rende"] = {
	name = "rende",
}
--[[
	技能：激将（主公技）
	描述：当你需要使用或打出一张【杀】时，你可令其他蜀势力角色打出一张【杀】（视为由你使用或打出）。
]]--
sgs.AISkills["jijiang"] = {
	name = "jijiang",
	lord = true,
}
--[[****************************************************************
	关羽
]]--****************************************************************
sgs.AIGenerals["guanyu"] = {
	name = "guanyu",
	IQ = 100,
}
--[[
	技能：武圣
	描述：你可以将一张红色牌当【杀】使用或打出。
]]--
sgs.AISkills["wusheng"] = {
	name = "wusheng",
}
--[[****************************************************************
	张飞
]]--****************************************************************
sgs.AIGenerals["zhangfei"] = {
	name = "zhangfei",
	IQ = 100,
}
--[[
	技能：咆哮（锁定技）
	描述：你于出牌阶段内使用【杀】无数量限制。
]]--
sgs.AISkills["paoxiao"] = {
	name = "paoxiao",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	诸葛亮
]]--****************************************************************
sgs.AIGenerals["zhugeliang"] = {
	name = "zhugeliang",
	IQ = 100,
}
--[[
	技能：观星
	描述：准备阶段开始时，你可以观看牌堆顶的X张牌，然后将任意数量的牌以任意顺序置于牌堆顶，将其余的牌以任意顺序置于牌堆底。（X为存活角色数且至多为5）
]]--
sgs.AISkills["guanxing"] = {
	name = "guanxing",
}
--[[
	技能：空城（锁定技）
	描述：若你没有手牌，你不能被选择为【杀】或【决斗】的目标。
]]--
sgs.AISkills["kongcheng"] = {
	name = "kongcheng",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	赵云
]]--****************************************************************
sgs.AIGenerals["zhaoyun"] = {
	name = "zhaoyun",
	IQ = 100,
}
--[[
	技能：龙胆
	描述：你可以将一张【杀】当【闪】使用或打出，或将一张【闪】当【杀】使用或打出。
]]--
sgs.AISkills["longdan"] = {
	name = "longdan",
}
--[[****************************************************************
	马超
]]--****************************************************************
sgs.AIGenerals["machao"] = {
	name = "machao",
	IQ = 100,
}
--[[
	技能：铁骑
	描述：每当你指定【杀】的目标后，你可以进行一次判定，若判定结果为红色，该角色不能使用【闪】对此【杀】进行响应。
]]--
sgs.AISkills["tieji"] = {
	name = "tieji",
}
--[[
	技能：马术（锁定技）
	描述：你与其他角色的距离-1。
]]--
sgs.AISkills["mashu"] = {
	name = "mashu",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	黄月英
]]--****************************************************************
sgs.AIGenerals["huangyueying"] = {
	name = "huangyueying",
	IQ = 100,
}
--[[
	技能：集智
	描述：每当你使用锦囊牌选择目标后，你可以展示牌堆顶的一张牌。若此牌为基本牌，你选择一项：1.将之置入弃牌堆；2.用一张手牌替换之。若此牌不为基本牌，你获得之。
]]--
sgs.AISkills["jizhi"] = {
	name = "jizhi",
}
--[[
	技能：奇才（锁定技）
	描述：你使用锦囊牌无距离限制。你装备区里除坐骑牌外的牌不能被其他角色弃置。
]]--
sgs.AISkills["qicai"] = {
	name = "qicai",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	孙权
]]--****************************************************************
sgs.AIGenerals["sunquan"] = {
	name = "sunquan",
	lord = true,
	IQ = 100,
}
--[[
	技能：制衡
	描述：出牌阶段限一次，你可以弃置任意数量的牌，然后摸等量的牌。
]]--
sgs.AISkills["zhiheng"] = {
	name = "zhiheng",
}
--[[
	技能：救援（主公技、锁定技）
	描述：其他吴势力角色对处于濒死状态的你使用的【桃】回复的体力+1。
]]--
sgs.AISkills["jiuyuan"] = {
	name = "jiuyuan",
	lord = true,
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	甘宁
]]--****************************************************************
sgs.AIGenerals["ganning"] = {
	name = "ganning",
	IQ = 100,
}
--[[
	技能：奇袭
	描述：你可以将一张黑色牌当【过河拆桥】使用。
]]--
sgs.AISkills["qixi"] = {
	name = "qixi",
}
--[[****************************************************************
	吕蒙
]]--****************************************************************
sgs.AIGenerals["lvmeng"] = {
	name = "lvmeng",
	IQ = 100,
}
--[[
	技能：克己
	描述：若你未于出牌阶段内使用或打出【杀】，你可以跳过你的弃牌阶段。
]]--
sgs.AISkills["keji"] = {
	name = "keji",
}
--[[****************************************************************
	黄盖
]]--****************************************************************
sgs.AIGenerals["huanggai"] = {
	name = "huanggai",
	IQ = 100,
}
--[[
	技能：苦肉
	描述：出牌阶段，你可以失去1点体力，然后摸两张牌。
]]--
sgs.AISkills["kurou"] = {
	name = "kurou",
}
--[[****************************************************************
	周瑜
]]--****************************************************************
sgs.AIGenerals["zhouyu"] = {
	name = "zhouyu",
	IQ = 100,
}
--[[
	技能：英姿
	描述：摸牌阶段，你可以额外摸一张牌。
]]--
sgs.AISkills["yingzi"] = {
	name = "yingzi",
}
--[[
	技能：反间
	描述：出牌阶段限一次，若你有手牌，你可以令一名其他角色选择一种花色，然后该角色获得你的一张手牌再展示之，若此牌的花色与其所选的不同，你对其造成1点伤害。
]]--
sgs.AISkills["fanjian"] = {
	name = "fanjian",
}
--[[****************************************************************
	大乔
]]--****************************************************************
sgs.AIGenerals["daqiao"] = {
	name = "daqiao",
	IQ = 100,
}
--[[
	技能：国色
	描述：你可以将一张♦牌当【乐不思蜀】使用。
]]--
sgs.AISkills["guose"] = {
	name = "guose",
}
--[[
	技能：流离
	描述：每当你成为【杀】的目标时，你可以弃置一张牌并选择你攻击范围内的一名其他角色（除此【杀】使用者），将此【杀】转移给该角色。
]]--
sgs.AISkills["liuli"] = {
	name = "liuli",
}
--[[****************************************************************
	陆逊
]]--****************************************************************
sgs.AIGenerals["luxun"] = {
	name = "luxun",
	IQ = 100,
}
--[[
	技能：谦逊（锁定技）
	描述：你不能被选择为【顺手牵羊】与【乐不思蜀】的目标。
]]--
sgs.AISkills["qianxun"] = {
	name = "qianxun",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：连营
	描述：每当你失去最后的手牌后，你可以摸一张牌。
]]--
sgs.AISkills["lianying"] = {
	name = "lianying",
}
--[[****************************************************************
	孙尚香
]]--****************************************************************
sgs.AIGenerals["sunshangxiang"] = {
	name = "sunshangxiang",
	IQ = 100,
}
--[[
	技能：结姻
	描述：出牌阶段限一次，你可以弃置两张手牌并选择一名已受伤的男性角色，你和该角色各回复1点体力。
]]--
sgs.AISkills["jieyin"] = {
	name = "jieyin",
}
--[[
	技能：枭姬
	描述：每当你失去一张装备区的装备牌后，你可以摸两张牌。
]]--
sgs.AISkills["xiaoji"] = {
	name = "xiaoji",
}
--[[****************************************************************
	华佗
]]--****************************************************************
sgs.AIGenerals["huatuo"] = {
	name = "huatuo",
	IQ = 100,
}
--[[
	技能：青囊
	描述：出牌阶段限一次，你可以弃置一张手牌并选择一名已受伤的角色，令该角色回复1点体力。
]]--
sgs.AISkills["qingnang"] = {
	name = "qingnang",
}
--[[
	技能：急救
	描述：你的回合外，你可以将一张红色牌当【桃】使用。
]]--
sgs.AISkills["jijiu"] = {
	name = "jijiu",
}
--[[****************************************************************
	吕布
]]--****************************************************************
sgs.AIGenerals["lvbu"] = {
	name = "lvbu",
	IQ = 100,
}
--[[
	技能：无双（锁定技）
	描述：每当你使用【杀】指定一名目标角色后，其需依次使用两张【闪】才能抵消。每当你使用【决斗】指定一名目标角色后，或成为一名角色使用【决斗】的目标后，其每次进行响应需依次打出两张【杀】。
]]--
sgs.AISkills["wushuang"] = {
	name = "wushuang",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	貂蝉
]]--****************************************************************
sgs.AIGenerals["diaochan"] = {
	name = "diaochan",
	IQ = 100,
}
--[[
	技能：离间
	描述：出牌阶段限一次，你可以弃置一张牌并选择两名男性角色，令其中一名男性角色视为对另一名男性角色使用一张【决斗】。
]]--
sgs.AISkills["lijian"] = {
	name = "lijian",
}
--[[
	技能：闭月
	描述：结束阶段开始时，你可以摸一张牌。 
]]--
sgs.AISkills["biyue"] = {
	name = "biyue",
}
--[[****************************************************************
	袁术
]]--****************************************************************
sgs.AIGenerals["st_yuanshu"] = {
	name = "st_yuanshu",
	IQ = 100,
}
--[[
	技能：妄尊
	描述：主公的准备阶段开始时，你可以摸一张牌，然后主公本回合手牌上限-1。
]]--
sgs.AISkills["wangzun"] = {
	name = "wangzun",
}
--[[
	技能：同疾（锁定技）
	描述：若你的手牌数大于你的体力值，且你在一名其他角色的攻击范围内，则其他角色不能被选择为该角色的【杀】的目标。
]]--
sgs.AISkills["tongji"] = {
	name = "tongji",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	华雄
]]--****************************************************************
sgs.AIGenerals["st_huaxiong"] = {
	name = "st_huaxiong",
	IQ = 100,
}
--[[
	技能：耀武（锁定技）
	描述：每当你受到红色【杀】的伤害时，伤害来源选择一项：回复1点体力，或摸一张牌。
]]--
sgs.AISkills["yaowu"] = {
	name = "yaowu",
	frequency = sgs.Skill_Compulsory,
}