--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·台版SP扩展包文件）
]]--
--[[****************************************************************
	貂蝉
]]--****************************************************************
sgs.AIGenerals["tw_diaochan"] = {
	name = "tw_diaochan",
	general = "diaochan",
	IQ = 100,
}
--[[
	技能：离间
	描述：出牌阶段限一次，你可以弃置一张牌并选择两名男性角色，令其中一名男性角色视为对另一名男性角色使用一张【决斗】。
]]--
--[[
	技能：闭月
	描述：结束阶段开始时，你可以摸一张牌。
]]--
--[[****************************************************************
	袁术
]]--****************************************************************
sgs.AIGenerals["tw_yuanshu"] = {
	name = "tw_yuanshu",
	general = "yuanshu",
	IQ = 100,
}
--[[
	技能：庸肆（锁定技）
	描述：摸牌阶段，你额外摸X张牌。弃牌阶段开始时，你弃置X张牌。（X为现存势力数）
]]--
--[[
	技能：伪帝（锁定技）
	描述：你拥有且可以发动当前主公的主公技。
]]--
--[[****************************************************************
	大乔
]]--****************************************************************
sgs.AIGenerals["tw_daqiao"] = {
	name = "tw_daqiao",
	general = "daqiao",
	IQ = 100,
}
--[[
	技能：国色
	描述：你可以将一张♦牌当【乐不思蜀】使用。
]]--
--[[
	技能：流离
	描述：每当你成为【杀】的目标时，你可以弃置一张牌并选择你攻击范围内的一名其他角色（除此【杀】使用者），将此【杀】转移给该角色。
]]--
--[[****************************************************************
	赵云
]]--****************************************************************
sgs.AIGenerals["tw_zhaoyun"] = {
	name = "tw_zhaoyun",
	general = "zhaoyun",
	IQ = 100,
}
--[[
	技能：龙胆
	描述：你可以将一张【杀】当【闪】使用或打出，或将一张【闪】当【杀】使用或打出。
]]--
--[[****************************************************************
	甄姬
]]--****************************************************************
sgs.AIGenerals["tw_zhenji"] = {
	name = "tw_zhenji",
	general = "zhenji",
	IQ = 100,
}
--[[
	技能：倾国
	描述：你可以将一张黑色手牌当【闪】使用或打出。
]]--
--[[
	技能：洛神
	描述：准备阶段开始时，你可以进行一次判定，若判定结果为黑色，你获得生效后的判定牌且你可以重复此流程。
]]--
--[[****************************************************************
	吕布
]]--****************************************************************
sgs.AIGenerals["tw_lvbu"] = {
	name = "tw_lvbu",
	general = "lvbu",
	IQ = 100,
}
--[[
	技能：无双（锁定技）
	描述：每当你使用【杀】指定一名目标角色后，其需依次使用两张【闪】才能抵消。每当你使用【决斗】指定一名目标角色后，或成为一名角色使用【决斗】的目标后，其每次进行响应需依次打出两张【杀】。
]]--
--[[****************************************************************
	甘宁
]]--****************************************************************
sgs.AIGenerals["tw_ganning"] = {
	name = "tw_ganning",
	general = "ganning",
	IQ = 100,
}
--[[
	技能：奇袭
	描述：你可以将一张黑色牌当【过河拆桥】使用。
]]--
--[[****************************************************************
	马超
]]--****************************************************************
sgs.AIGenerals["tw_machao"] = {
	name = "tw_machao",
	general = "machao",
	IQ = 100,
}
--[[
	技能：马术（锁定技）
	描述：你与其他角色的距离-1。
]]--
--[[
	技能：铁骑
	描述：每当你指定【杀】的目标后，你可以进行一次判定，若判定结果为红色，该角色不能使用【闪】对此【杀】进行响应。
]]--
--[[****************************************************************
	黄月英
]]--****************************************************************
sgs.AIGenerals["tw_huangyueying"] = {
	name = "tw_huangyueying",
	general = "huangyueying",
	IQ = 100,
}
--[[
	技能：集智
	描述：每当你使用非延时类锦囊牌选择目标后，你可以摸一张牌。
]]--
--[[
	技能：奇才（锁定技）
	描述：你使用锦囊牌无距离限制。
]]--
--[[****************************************************************
	诸葛亮
]]--****************************************************************
sgs.AIGenerals["tw_zhugeliang"] = {
	name = "tw_zhugeliang",
	general = "zhugeliang",
	IQ = 100,
}
--[[
	技能：观星
	描述：准备阶段开始时，你可以观看牌堆顶的X张牌，然后将任意数量的牌以任意顺序置于牌堆顶，将其余的牌以任意顺序置于牌堆底。（X为存活角色数且至多为5）
]]--
--[[
	技能：空城（锁定技）
	描述：若你没有手牌，你不能被选择为【杀】或【决斗】的目标。
]]--
--[[****************************************************************
	张辽
]]--****************************************************************
sgs.AIGenerals["tw_zhangliao"] = {
	name = "tw_zhangliao",
	general = "zhangliao",
	IQ = 100,
}
--[[
	技能：突袭
	描述：摸牌阶段开始时，你可以放弃摸牌并选择一至两名有手牌的其他角色，改为获得他们的各一张手牌。
]]--
--[[****************************************************************
	黄盖
]]--****************************************************************
sgs.AIGenerals["tw_huanggai"] = {
	name = "tw_huanggai",
	general = "huanggai",
	IQ = 100,
}
--[[
	技能：苦肉
	描述：出牌阶段，你可以失去1点体力，然后摸两张牌。
]]--
--[[****************************************************************
	郭嘉
]]--****************************************************************
sgs.AIGenerals["tw_guojia"] = {
	name = "tw_guojia",
	general = "guojia",
	IQ = 100,
}
--[[
	技能：天妒
	描述：每当你的判定牌生效后，你可以获得之。
]]--
--[[
	技能：遗计
	描述：每当你受到1点伤害后，你可以观看牌堆顶的两张牌，然后将一张牌交给一名角色，将另一张牌交给一名角色。
]]--
--[[****************************************************************
	陆逊
]]--****************************************************************
sgs.AIGenerals["tw_luxun"] = {
	name = "tw_luxun",
	general = "luxun",
	IQ = 100,
}
--[[
	技能：谦逊（锁定技）
	描述：你不能被选择为【顺手牵羊】与【乐不思蜀】的目标。
]]--
--[[
	技能：连营
	描述：每当你失去最后的手牌后，你可以摸一张牌。
]]--