--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·王者之战专属扩展包文件）
]]--
--[[****************************************************************
	大乔
]]--****************************************************************
sgs.AIGenerals["wz_daqiao"] = {
	name = "wz_daqiao",
	general = "daqiao",
	IQ = 100,
}
--[[
	技能：国色
	描述：你可以将一张♦牌当【乐不思蜀】使用。
]]--
--[[
	技能：流离
	描述：每当你成为【杀】的目标时，你可以弃置一张牌并选择你攻击范围内的一名其他角色（除此【杀】使用者），将此【杀】转移给该角色。
]]--
--[[****************************************************************
	小乔
]]--****************************************************************
sgs.AIGenerals["wz_xiaoqiao"] = {
	name = "wz_xiaoqiao",
	general = "xiaoqiao",
	IQ = 100,
}
--[[
	技能：天香
	描述：每当你受到伤害时，你可以弃置一张♥手牌并选择一名其他角色，将此伤害转移给该角色，然后其在伤害结算后摸X张牌（X为其当前已损失的体力值）。
]]--
--[[
	技能：红颜（锁定技）
	描述：你的♠牌视为♥牌。
]]--