--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·倚天扩展包文件）
]]--
--[[****************************************************************
	魏武帝
]]--****************************************************************
sgs.AIGenerals["yt_shencaocao"] = {
	name = "yt_shencaocao",
	general = "caocao",
	IQ = 100,
}
--[[
	武将：归心
	技能：回合结束阶段，你可以做以下二选一：
1. 永久改变一名其他角色的势力
2. 永久获得一项未上场或已死亡角色的主公技。(获得后即使你不是主公仍然有效) 
]]--
sgs.AISkills["weiwudi_guixin"] = {
	name = "weiwudi_guixin",
}
--[[
	武将：飞影（锁定技）
	技能：其他角色与你的距离+1
]]--
--[[****************************************************************
	曹冲
]]--****************************************************************
sgs.AIGenerals["yt_caochong"] = {
	name = "yt_caochong",
	general = "caochong",
	IQ = 100,
}
--[[
	武将：称象
	技能：每当你受到一次伤害后，你可以弃置X张点数之和与造成伤害的牌的点数相等的牌，你可以选择至多X名角色，若其已受伤则回复1点体力，否则摸两张牌。
]]--
sgs.AISkills["ytchengxiang"] = {
	name = "ytchengxiang",
}
--[[
	武将：聪慧（锁定技）
	技能：跳过你的弃牌阶段。
]]--
sgs.AISkills["conghui"] = {
	name = "conghui",
	frequency = sgs.Skill_Compulsory,
}
--[[
	武将：早夭（锁定技）
	技能：回合结束阶段开始时，若你的手牌数大于13，你须弃置所有手牌并失去1点体力。
]]--
sgs.AISkills["zaoyao"] = {
	name = "zaoyao",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	张儁乂
]]--****************************************************************
sgs.AIGenerals["zhangjunyi"] = {
	name = "zhangjunyi",
	general = "zhanghe",
	IQ = 100,
}
--[[
	武将：绝汲
	技能：出牌阶段限一次，你可以和一名角色拼点：若你赢，你获得对方的拼点牌。你可以重复此流程，直到你拼点没赢为止。
]]--
sgs.AISkills["jueji"] = {
	name = "jueji",
}
--[[****************************************************************
	陆抗
]]--****************************************************************
sgs.AIGenerals["lukang"] = {
	name = "lukang",
	general = "lukang",
	IQ = 100,
}
--[[
	武将：围堰
	技能：你可以将摸牌阶段视为出牌阶段，将出牌阶段视为摸牌阶段。
]]--
sgs.AISkills["lukang_weiyan"] = {
	name = "lukang_weiyan",
}
--[[
	武将：克构（觉醒技）
	技能：回合开始阶段开始时，若你是除主公外唯一的吴势力角色，你须减少1点体力上限并获得技能“连营”。
]]--
sgs.AISkills["kegou"] = {
	name = "kegou",
	frequency = sgs.Skill_Wake,
}
--[[****************************************************************
	晋宣帝
]]--****************************************************************
sgs.AIGenerals["jinxuandi"] = {
	name = "jinxuandi",
	general = "simayi",
	IQ = 100,
}
--[[
	武将：五灵
	技能：回合开始阶段开始时，你可选择一种五灵效果发动，该效果对场上所有角色生效
该效果直到你的下回合开始为止，你选择的五灵效果不可与上回合重复
[风]一名角色受到的火焰伤害+1。
[雷]一名角色受到的雷电伤害+1。
[水]一名角色使用【桃】时额外回复1点体力。
[火]一名角色受到的伤害均视为火焰伤害。
[土]一名角色受到的属性伤害大于1时，防止多余的伤害。
]]--
sgs.AISkills["wuling"] = {
	name = "wuling",
}
--[[****************************************************************
	夏侯涓
]]--****************************************************************
sgs.AIGenerals["xiahoujuan"] = {
	name = "xiahoujuan",
	general = "xiahoujuan",
	IQ = 100,
}
--[[
	武将：连理
	技能：回合开始阶段开始时，你可以选择一名男性角色，你和其进入连理状态直到你的下回合开始：该角色可以帮你出闪，你可以帮其出杀
]]--
sgs.AISkills["lianli"] = {
	name = "lianli",
}
--[[
	武将：同心
	技能：处于连理状态的两名角色，每受到一点伤害，你可以令你们两人各摸一张牌
]]--
sgs.AISkills["tongxin"] = {
	name = "tongxin",
}
--[[
	武将：离迁（锁定技）
	技能：当你处于连理状态时，势力与连理对象的势力相同；当你处于未连理状态时，势力为魏
]]--
sgs.AISkills["liqian"] = {
	name = "liqian",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	蔡昭姬
]]--****************************************************************
sgs.AIGenerals["caizhaoji"] = {
	name = "caizhaoji",
	general = "caiyan",
	IQ = 100,
}
--[[
	武将：归汉
	技能：出牌阶段限一次，你可以弃置两张相同花色的红色手牌选择一名其他角色，你与该角色交换位置。
]]--
sgs.AISkills["guihan"] = {
	name = "guihan",
}
--[[
	武将：胡笳
	技能：回合结束阶段开始时，你可以进行一次判定：若为红色，获得此判定牌。你可以重复此流程，直到出现黑色为止。若你在一个阶段内累计发动3次或更多的“胡笳”，你的武将牌翻面。
]]--
sgs.AISkills["caizhaoji_hujia"] = {
	name = "caizhaoji_hujia",
}
--[[****************************************************************
	陆伯言
]]--****************************************************************
sgs.AIGenerals["luboyan"] = {
	name = "luboyan",
	general = "luxun",
	IQ = 100,
}
--[[
	武将：神君（锁定技）
	技能：游戏开始时，你选择自己的性别。回合开始阶段开始时，你须改变性别，你受到异性角色造成的非雷电属性伤害时，你防止之。
]]--
sgs.AISkills["shenjun"] = {
	name = "shenjun",
	frequency = sgs.Skill_Compulsory,
}
--[[
	武将：烧营
	技能：当你对一名不处于连环状态的角色造成一次火焰伤害，在扣减体力前，你可选择一名其距离为1的另外一名角色，在该伤害结算完毕后，你进行一次判定：若判定结果为红色，你对选择的角色造成1点火焰伤害。
]]--
sgs.AISkills["shaoying"] = {
	name = "shaoying",
}
--[[
	武将：纵火（锁定技）
	技能：你使用的【杀】视为火【杀】。
]]--
sgs.AISkills["zonghuo"] = {
	name = "zonghuo",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	钟士季
]]--****************************************************************
sgs.AIGenerals["zhongshiji"] = {
	name = "zhongshiji",
	general = "zhonghui",
	IQ = 100,
}
--[[
	武将：共谋
	技能：回合结束阶段开始时，可指定一名其他角色：其在摸牌阶段摸牌后，须给你X张手牌（X为你手牌数与对方手牌数的较小值），然后你须选择X张手牌交给对方
]]--
sgs.AISkills["gongmou"] = {
	name = "gongmou",
}
--[[****************************************************************
	姜伯约
]]--****************************************************************
sgs.AIGenerals["jiangboyue"] = {
	name = "jiangboyue",
	general = "jiangwei",
	IQ = 100,
}
--[[
	武将：乐学
	技能：出牌阶段限一次，你可以令一名其他角色展示一张手牌：若该牌为基本牌或非延时类锦囊牌，你可以将与该牌同花色的牌当作该牌使用或打出直到回合结束；否则，你获得该牌。
]]--
sgs.AISkills["lexue"] = {
	name = "lexue",
}
--[[
	武将：殉志
	技能：出牌阶段，你可以摸三张牌并变身为其他未上场或已阵亡的蜀势力角色，回合结束后你死亡。
]]--
sgs.AISkills["xunzhi"] = {
	name = "xunzhi",
}
--[[****************************************************************
	贾文和
]]--****************************************************************
sgs.AIGenerals["jiawenhe"] = {
	name = "jiawenhe",
	general = "jiaxu",
	IQ = 999,
}
--[[
	武将：洞察
	技能：回合开始阶段开始时，你可以指定一名其他角色：该角色的所有手牌对你处于可见状态，直到你的本回合结束。其他角色都不知道你对谁发动了洞察技能，包括被洞察的角色本身。
]]--
sgs.AISkills["dongcha"] = {
	name = "dongcha",
}
--[[
	武将：毒士（锁定技）
	技能：杀死你的角色获得技能“崩坏”。
]]--
sgs.AISkills["dushi"] = {
	name = "dushi",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	古之恶来
]]--****************************************************************
sgs.AIGenerals["guzhielai"] = {
	name = "guzhielai",
	general = "dianwei",
	IQ = 100,
}
--[[
	武将：死战（锁定技）
	技能：每当你受到一次伤害时，防止此伤害并获得等同于伤害点数的“死战”标记；回合结束阶段开始时，你失去等同于你拥有的“死战”标记数的体力并弃所有的死战标记。
]]--
sgs.AISkills["sizhan"] = {
	name = "sizhan",
	frequency = sgs.Skill_Compulsory,
}
--[[
	武将：神力（锁定技）
	技能：出牌阶段，你使用【杀】造成的第一次伤害+X，X为当前死战标记数且最大为3
]]--
sgs.AISkills["shenli"] = {
	name = "shenli",
	frequency = sgs.Skill_Compulsory,
}
--[[****************************************************************
	邓士载
]]--****************************************************************
sgs.AIGenerals["dengshizai"] = {
	name = "dengshizai",
	general = "dengai",
	IQ = 100,
}
--[[
	武将：争功
	技能：其他角色的回合开始前，若你的武将牌正面朝上，你可以进行一个额外的回合，然后将武将牌翻面。
]]--
sgs.AISkills["zhenggong"] = {
	name = "zhenggong",
}
--[[
	武将：偷渡
	技能：每当你受到一次伤害后，若你的武将牌背面朝上，你可以弃置一张手牌并将你的武将牌翻面，视为对一名其他角色使用了一张【杀】。
]]--
sgs.AISkills["toudu"] = {
	name = "toudu",
}
--[[****************************************************************
	张公祺
]]--****************************************************************
sgs.AIGenerals["zhanggongqi"] = {
	name = "zhanggongqi",
	general = "zhanglu",
	IQ = 100,
}
--[[
	武将：义舍
	技能：出牌阶段，你可将任意数量手牌正面朝上移出游戏称为“米”（至多存在五张）或收回；其他角色在其出牌阶段可选择一张“米”询问你，若你同意，该角色获得这张牌，每阶段限两次
]]--
sgs.AISkills["yishe"] = {
	name = "yishe",
}
--[[
	武将：惜粮
	技能：你可将其他角色弃牌阶段弃置的红牌收为“米”或加入手牌
]]--
sgs.AISkills["xiliang"] = {
	name = "xiliang",
}
--[[****************************************************************
	倚天剑
]]--****************************************************************
sgs.AIGenerals["yitianjian"] = {
	name = "yitianjian",
	general = "yitianjian",
	IQ = 100,
}
--[[
	武将：争锋（锁定技）
	技能：当你的装备区没有武器时，你的攻击范围为X，X为你当前体力值。
]]--
sgs.AISkills["zhengfeng"] = {
	name = "zhengfeng",
	frequency = sgs.Skill_Compulsory,
}
--[[
	武将：镇威
	技能：你的【杀】被手牌中的【闪】抵消时，可立即获得该【闪】。
]]--
sgs.AISkills["ytzhenwei"] = {
	name = "ytzhenwei",
}
--[[
	武将：倚天（联动技）
	技能：当你对曹操造成伤害时，可令该伤害-1
]]--
sgs.AISkills["yitian"] = {
	name = "yitian",
}
--[[****************************************************************
	庞令明
]]--****************************************************************
sgs.AIGenerals["panglingming"] = {
	name = "panglingming",
	general = "pangde",
	IQ = 100,
}
--[[
	武将：抬榇
	技能：出牌阶段，你可以失去1点体力或弃置一张武器牌，依次弃置你攻击范围内的一名角色区域内的两张牌。
]]--
sgs.AISkills["taichen"] = {
	name = "taichen",
}