--[[
	太阳神三国杀·幻想天使AI体系（扩展模块·僵尸模式文件）
]]--
--[[****************************************************************
	剧情规则
]]--****************************************************************
--[[****************************************************************
	专属武将与技能
]]--****************************************************************
--[[
	技能：互助
	描述：弃置1张【桃】，视为对一名距离1以内的玩家使用了“青囊”。
]]--
sgs.AISkills["peaching"] = {
	name = "peaching",
}
--[[----------------------------------------------------------------
	僵尸
]]------------------------------------------------------------------
sgs.AIGenerals["zombie"] = {
	name = "zombie",
	general = "zombie",
	IQ = 40,
}
--[[
	技能：迅猛（锁定技）
	描述：你的杀造成的伤害+1。你的杀造成伤害时若你体力大于1，你流失1点体力。 
]]--
sgs.AISkills["xunmeng"] = {
	name = "xunmeng",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：感染（锁定技）
	描述：你的装备牌都视为铁锁连环。
]]--
sgs.AISkills["ganran"] = {
	name = "ganran",
	frequency = sgs.Skill_Compulsory,
}
--[[
	技能：灾变（锁定技）
	描述：你的出牌阶段开始时，若人类玩家数-僵尸玩家数+1大于0，你多摸该数目的牌。
]]--
sgs.AISkills["zaibian"] = {
	name = "zaibian",
	frequency = sgs.Skill_Compulsory,
}